grevaillot/svd_tools/headers/ATSAMR35J16B/tcc1.h
#pragma once 

/* --- TCC1: Timer Counter Control 1 -------------------------------- */

/** @defgroup tcc1_registers Timer Counter Control 1 Register
@{*/

/** TCC1_CTRLA Control A **/
#define TCC1_CTRLA			MMIO32(TCC1_BASE + 0x00)
/** TCC1_CTRLBCLR Control B Clear **/
#define TCC1_CTRLBCLR			MMIO32(TCC1_BASE + 0x04)
/** TCC1_CTRLBSET Control B Set **/
#define TCC1_CTRLBSET			MMIO32(TCC1_BASE + 0x05)
/** TCC1_SYNCBUSY Synchronization Busy **/
#define TCC1_SYNCBUSY			MMIO32(TCC1_BASE + 0x08)
/** TCC1_FCTRLA Recoverable Fault A Configuration **/
#define TCC1_FCTRLA			MMIO32(TCC1_BASE + 0x0c)
/** TCC1_FCTRLB Recoverable Fault B Configuration **/
#define TCC1_FCTRLB			MMIO32(TCC1_BASE + 0x10)
/** TCC1_WEXCTRL Waveform Extension Configuration **/
#define TCC1_WEXCTRL			MMIO32(TCC1_BASE + 0x14)
/** TCC1_DRVCTRL Driver Control **/
#define TCC1_DRVCTRL			MMIO32(TCC1_BASE + 0x18)
/** TCC1_DBGCTRL Debug Control **/
#define TCC1_DBGCTRL			MMIO32(TCC1_BASE + 0x1e)
/** TCC1_EVCTRL Event Control **/
#define TCC1_EVCTRL			MMIO32(TCC1_BASE + 0x20)
/** TCC1_INTENCLR Interrupt Enable Clear **/
#define TCC1_INTENCLR			MMIO32(TCC1_BASE + 0x24)
/** TCC1_INTENSET Interrupt Enable Set **/
#define TCC1_INTENSET			MMIO32(TCC1_BASE + 0x28)
/** TCC1_INTFLAG Interrupt Flag Status and Clear **/
#define TCC1_INTFLAG			MMIO32(TCC1_BASE + 0x2c)
/** TCC1_STATUS Status **/
#define TCC1_STATUS			MMIO32(TCC1_BASE + 0x30)
/** TCC1_COUNT Count **/
#define TCC1_COUNT			MMIO32(TCC1_BASE + 0x34)
/** TCC1_COUNT_DITH4 Count **/
#define TCC1_COUNT_DITH4			MMIO32(TCC1_BASE + 0x34)
/** TCC1_COUNT_DITH5 Count **/
#define TCC1_COUNT_DITH5			MMIO32(TCC1_BASE + 0x34)
/** TCC1_COUNT_DITH6 Count **/
#define TCC1_COUNT_DITH6			MMIO32(TCC1_BASE + 0x34)
/** TCC1_PATT Pattern **/
#define TCC1_PATT			MMIO32(TCC1_BASE + 0x38)
/** TCC1_WAVE Waveform Control **/
#define TCC1_WAVE			MMIO32(TCC1_BASE + 0x3c)
/** TCC1_PER Period **/
#define TCC1_PER			MMIO32(TCC1_BASE + 0x40)
/** TCC1_PER_DITH4 Period **/
#define TCC1_PER_DITH4			MMIO32(TCC1_BASE + 0x40)
/** TCC1_PER_DITH5 Period **/
#define TCC1_PER_DITH5			MMIO32(TCC1_BASE + 0x40)
/** TCC1_PER_DITH6 Period **/
#define TCC1_PER_DITH6			MMIO32(TCC1_BASE + 0x40)
/** TCC1_CC0 Compare and Capture **/
#define TCC1_CC0			MMIO32(TCC1_BASE + 0x44)
/** TCC1_CC0_DITH4 Compare and Capture **/
#define TCC1_CC0_DITH4			MMIO32(TCC1_BASE + 0x44)
/** TCC1_CC0_DITH5 Compare and Capture **/
#define TCC1_CC0_DITH5			MMIO32(TCC1_BASE + 0x44)
/** TCC1_CC0_DITH6 Compare and Capture **/
#define TCC1_CC0_DITH6			MMIO32(TCC1_BASE + 0x44)
/** TCC1_CC1 Compare and Capture **/
#define TCC1_CC1			MMIO32(TCC1_BASE + 0x48)
/** TCC1_CC1_DITH4 Compare and Capture **/
#define TCC1_CC1_DITH4			MMIO32(TCC1_BASE + 0x48)
/** TCC1_CC1_DITH5 Compare and Capture **/
#define TCC1_CC1_DITH5			MMIO32(TCC1_BASE + 0x48)
/** TCC1_CC1_DITH6 Compare and Capture **/
#define TCC1_CC1_DITH6			MMIO32(TCC1_BASE + 0x48)
/** TCC1_CC2 Compare and Capture **/
#define TCC1_CC2			MMIO32(TCC1_BASE + 0x4c)
/** TCC1_CC2_DITH4 Compare and Capture **/
#define TCC1_CC2_DITH4			MMIO32(TCC1_BASE + 0x4c)
/** TCC1_CC2_DITH5 Compare and Capture **/
#define TCC1_CC2_DITH5			MMIO32(TCC1_BASE + 0x4c)
/** TCC1_CC2_DITH6 Compare and Capture **/
#define TCC1_CC2_DITH6			MMIO32(TCC1_BASE + 0x4c)
/** TCC1_CC3 Compare and Capture **/
#define TCC1_CC3			MMIO32(TCC1_BASE + 0x50)
/** TCC1_CC3_DITH4 Compare and Capture **/
#define TCC1_CC3_DITH4			MMIO32(TCC1_BASE + 0x50)
/** TCC1_CC3_DITH5 Compare and Capture **/
#define TCC1_CC3_DITH5			MMIO32(TCC1_BASE + 0x50)
/** TCC1_CC3_DITH6 Compare and Capture **/
#define TCC1_CC3_DITH6			MMIO32(TCC1_BASE + 0x50)
/** TCC1_PATTBUF Pattern Buffer **/
#define TCC1_PATTBUF			MMIO32(TCC1_BASE + 0x64)
/** TCC1_PERBUF Period Buffer **/
#define TCC1_PERBUF			MMIO32(TCC1_BASE + 0x6c)
/** TCC1_PERBUF_DITH4 Period Buffer **/
#define TCC1_PERBUF_DITH4			MMIO32(TCC1_BASE + 0x6c)
/** TCC1_PERBUF_DITH5 Period Buffer **/
#define TCC1_PERBUF_DITH5			MMIO32(TCC1_BASE + 0x6c)
/** TCC1_PERBUF_DITH6 Period Buffer **/
#define TCC1_PERBUF_DITH6			MMIO32(TCC1_BASE + 0x6c)
/** TCC1_CCBUF0 Compare and Capture Buffer **/
#define TCC1_CCBUF0			MMIO32(TCC1_BASE + 0x70)
/** TCC1_CCBUF0_DITH4 Compare and Capture Buffer **/
#define TCC1_CCBUF0_DITH4			MMIO32(TCC1_BASE + 0x70)
/** TCC1_CCBUF0_DITH5 Compare and Capture Buffer **/
#define TCC1_CCBUF0_DITH5			MMIO32(TCC1_BASE + 0x70)
/** TCC1_CCBUF0_DITH6 Compare and Capture Buffer **/
#define TCC1_CCBUF0_DITH6			MMIO32(TCC1_BASE + 0x70)
/** TCC1_CCBUF1 Compare and Capture Buffer **/
#define TCC1_CCBUF1			MMIO32(TCC1_BASE + 0x74)
/** TCC1_CCBUF1_DITH4 Compare and Capture Buffer **/
#define TCC1_CCBUF1_DITH4			MMIO32(TCC1_BASE + 0x74)
/** TCC1_CCBUF1_DITH5 Compare and Capture Buffer **/
#define TCC1_CCBUF1_DITH5			MMIO32(TCC1_BASE + 0x74)
/** TCC1_CCBUF1_DITH6 Compare and Capture Buffer **/
#define TCC1_CCBUF1_DITH6			MMIO32(TCC1_BASE + 0x74)
/** TCC1_CCBUF2 Compare and Capture Buffer **/
#define TCC1_CCBUF2			MMIO32(TCC1_BASE + 0x78)
/** TCC1_CCBUF2_DITH4 Compare and Capture Buffer **/
#define TCC1_CCBUF2_DITH4			MMIO32(TCC1_BASE + 0x78)
/** TCC1_CCBUF2_DITH5 Compare and Capture Buffer **/
#define TCC1_CCBUF2_DITH5			MMIO32(TCC1_BASE + 0x78)
/** TCC1_CCBUF2_DITH6 Compare and Capture Buffer **/
#define TCC1_CCBUF2_DITH6			MMIO32(TCC1_BASE + 0x78)
/** TCC1_CCBUF3 Compare and Capture Buffer **/
#define TCC1_CCBUF3			MMIO32(TCC1_BASE + 0x7c)
/** TCC1_CCBUF3_DITH4 Compare and Capture Buffer **/
#define TCC1_CCBUF3_DITH4			MMIO32(TCC1_BASE + 0x7c)
/** TCC1_CCBUF3_DITH5 Compare and Capture Buffer **/
#define TCC1_CCBUF3_DITH5			MMIO32(TCC1_BASE + 0x7c)
/** TCC1_CCBUF3_DITH6 Compare and Capture Buffer **/
#define TCC1_CCBUF3_DITH6			MMIO32(TCC1_BASE + 0x7c)

/**@}*/


/** @defgroup tcc1_ctrla CTRLA Control A
@{*/

/** TCC1_CTRLA_CPTEN3 Capture Channel 3 Enable **/
#define TCC1_CTRLA_CPTEN3		(1 << 27)
/** TCC1_CTRLA_CPTEN2 Capture Channel 2 Enable **/
#define TCC1_CTRLA_CPTEN2		(1 << 26)
/** TCC1_CTRLA_CPTEN1 Capture Channel 1 Enable **/
#define TCC1_CTRLA_CPTEN1		(1 << 25)
/** TCC1_CTRLA_CPTEN0 Capture Channel 0 Enable **/
#define TCC1_CTRLA_CPTEN0		(1 << 24)
/** TCC1_CTRLA_DMAOS DMA One-shot Trigger Mode **/
#define TCC1_CTRLA_DMAOS		(1 << 23)
/** TCC1_CTRLA_MSYNC Master Synchronization (only for TCC Slave Instance) **/
#define TCC1_CTRLA_MSYNC		(1 << 15)
/** TCC1_CTRLA_ALOCK Auto Lock **/
#define TCC1_CTRLA_ALOCK		(1 << 14)

#define TCC1_CTRLA_PRESCSYNC_SHIFT		12
#define TCC1_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tcc1_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization Selection
@{*/
/**@}*/

