grevaillot/svd_tools/headers/ATSAMR35J16B/tcc1.h
/** @defgroup tcc1_perbuf_dith4 PERBUFDITH4 Period Buffer
@{*/


#define TCC1_PERBUF_DITH4_PERBUF_SHIFT		4
#define TCC1_PERBUF_DITH4_PERBUF_MASK		0xfffff
/** @defgroup tcc1_perbuf_dith4_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


#define TCC1_PERBUF_DITH4_DITHERBUF_SHIFT		0
#define TCC1_PERBUF_DITH4_DITHERBUF_MASK		0x0f
/** @defgroup tcc1_perbuf_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_perbuf_dith5 PERBUFDITH5 Period Buffer
@{*/


#define TCC1_PERBUF_DITH5_PERBUF_SHIFT		5
#define TCC1_PERBUF_DITH5_PERBUF_MASK		0x7ffff
/** @defgroup tcc1_perbuf_dith5_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


#define TCC1_PERBUF_DITH5_DITHERBUF_SHIFT		0
#define TCC1_PERBUF_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc1_perbuf_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_perbuf_dith6 PERBUFDITH6 Period Buffer
@{*/


#define TCC1_PERBUF_DITH6_PERBUF_SHIFT		6
#define TCC1_PERBUF_DITH6_PERBUF_MASK		0x3ffff
/** @defgroup tcc1_perbuf_dith6_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


#define TCC1_PERBUF_DITH6_DITHERBUF_SHIFT		0
#define TCC1_PERBUF_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc1_perbuf_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf0 CCBUF0 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF0_CCBUF_SHIFT		0
#define TCC1_CCBUF0_CCBUF_MASK		0xffffff
/** @defgroup tcc1_ccbuf0_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf0_dith4 CCBUF0DITH4 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF0_DITH4_DITHERBUF_SHIFT		4
#define TCC1_CCBUF0_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc1_ccbuf0_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC1_CCBUF0_DITH4_CCBUF_SHIFT		0
#define TCC1_CCBUF0_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc1_ccbuf0_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf0_dith5 CCBUF0DITH5 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF0_DITH5_CCBUF_SHIFT		5
#define TCC1_CCBUF0_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc1_ccbuf0_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF0_DITH5_DITHERBUF_SHIFT		0
#define TCC1_CCBUF0_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc1_ccbuf0_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf0_dith6 CCBUF0DITH6 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF0_DITH6_CCBUF_SHIFT		6
#define TCC1_CCBUF0_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc1_ccbuf0_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF0_DITH6_DITHERBUF_SHIFT		0
#define TCC1_CCBUF0_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc1_ccbuf0_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf1 CCBUF1 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF1_CCBUF_SHIFT		0
#define TCC1_CCBUF1_CCBUF_MASK		0xffffff
/** @defgroup tcc1_ccbuf1_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf1_dith4 CCBUF1DITH4 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF1_DITH4_DITHERBUF_SHIFT		4
#define TCC1_CCBUF1_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc1_ccbuf1_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC1_CCBUF1_DITH4_CCBUF_SHIFT		0
#define TCC1_CCBUF1_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc1_ccbuf1_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf1_dith5 CCBUF1DITH5 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF1_DITH5_CCBUF_SHIFT		5
#define TCC1_CCBUF1_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc1_ccbuf1_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF1_DITH5_DITHERBUF_SHIFT		0
#define TCC1_CCBUF1_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc1_ccbuf1_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf1_dith6 CCBUF1DITH6 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF1_DITH6_CCBUF_SHIFT		6
#define TCC1_CCBUF1_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc1_ccbuf1_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF1_DITH6_DITHERBUF_SHIFT		0
#define TCC1_CCBUF1_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc1_ccbuf1_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf2 CCBUF2 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF2_CCBUF_SHIFT		0
#define TCC1_CCBUF2_CCBUF_MASK		0xffffff
/** @defgroup tcc1_ccbuf2_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf2_dith4 CCBUF2DITH4 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF2_DITH4_DITHERBUF_SHIFT		4
#define TCC1_CCBUF2_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc1_ccbuf2_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC1_CCBUF2_DITH4_CCBUF_SHIFT		0
#define TCC1_CCBUF2_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc1_ccbuf2_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf2_dith5 CCBUF2DITH5 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF2_DITH5_CCBUF_SHIFT		5
#define TCC1_CCBUF2_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc1_ccbuf2_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF2_DITH5_DITHERBUF_SHIFT		0
#define TCC1_CCBUF2_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc1_ccbuf2_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf2_dith6 CCBUF2DITH6 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF2_DITH6_CCBUF_SHIFT		6
#define TCC1_CCBUF2_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc1_ccbuf2_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF2_DITH6_DITHERBUF_SHIFT		0
#define TCC1_CCBUF2_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc1_ccbuf2_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf3 CCBUF3 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF3_CCBUF_SHIFT		0
#define TCC1_CCBUF3_CCBUF_MASK		0xffffff
/** @defgroup tcc1_ccbuf3_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf3_dith4 CCBUF3DITH4 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF3_DITH4_DITHERBUF_SHIFT		4
#define TCC1_CCBUF3_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc1_ccbuf3_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC1_CCBUF3_DITH4_CCBUF_SHIFT		0
#define TCC1_CCBUF3_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc1_ccbuf3_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf3_dith5 CCBUF3DITH5 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF3_DITH5_CCBUF_SHIFT		5
#define TCC1_CCBUF3_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc1_ccbuf3_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF3_DITH5_DITHERBUF_SHIFT		0
#define TCC1_CCBUF3_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc1_ccbuf3_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc1_ccbuf3_dith6 CCBUF3DITH6 Compare and Capture Buffer
@{*/


#define TCC1_CCBUF3_DITH6_CCBUF_SHIFT		6
#define TCC1_CCBUF3_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc1_ccbuf3_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC1_CCBUF3_DITH6_DITHERBUF_SHIFT		0
#define TCC1_CCBUF3_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc1_ccbuf3_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/
